import re


def clean_text(text):
        """移除文本中的表情符号"""
        emoji_pattern = re.compile(
            "[\U0001F600-\U0001F64F]"  # 表情符号 (如😀、😂)
            "|[\U0001F300-\U0001F5FF]"  # 符号 & 皮肤调色盘 (如⛅、🎉)
            "|[\U0001F680-\U0001F6FF]"  # 运输 & 地图 (如🚀、🚗)
            "|[\U0001F700-\U0001F77F]"  # 额外符号 (如🛠️、🧩)
            "|[\U0001F780-\U0001F7FF]"  # 几何形状 (如🟠、🔷)
            "|[\U0001F800-\U0001F8FF]"  # 额外符号 (如🧶、🛒)
            "|[\U0001F900-\U0001F9FF]"  # 表情符号补充 (如🤩、🥳)
            "|[\U0001FA00-\U0001FAFF]"  # 额外符号 (如🛖、🛟)
            "|[\u2600-\u26FF]"  # 杂项符号 (如☀、⚡)
            "|[\u2700-\u27BF]"  # 杂项符号和箭头 (如✂、✔)"
            "+", flags=re.UNICODE
        )
        return emoji_pattern.sub('', text)